// Задача 39: Напишите программу, которая перевернёт одномерный массив 
// (последний элемент будет на первом месте, а первый - на последнем и т.д.)
// [1 2 3 4 5] -> [5 4 3 2 1]
// [6 7 3 6] -> [6 3 7 6]

int[] RandomArr(int size, int minnum, int maxnum) //метод заполнения массива рандомно
{
    int[] arr = new int[size];
    Random rand = new Random();
    for(int i = 0; i < arr.Length; i++)
    {
        arr[i] = rand.Next(minnum, maxnum + 1);
    }
    return arr;

}

void ReverseArr(int[] arr)  //метод разворота массива
{
    for(int i = 0; i < arr.Length / 2; i++)
    {
        int temp = arr[i];
        arr[i] = arr[arr.Length - 1 - i];
        arr[arr.Length - 1 - i] = temp;
    }
}

// Console.WriteLine("Введите колличество элементов массива: ");
// int kollnum = Convert.ToInt32(Console.ReadLine());
int[] array = RandomArr(10, -9, 9);
Console.WriteLine(string.Join(", ", array));
ReverseArr(array);
Console.WriteLine(string.Join(", ", array));